---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RibbonItemEventArgs Properties
RibbonItemEventArgs Class See Also Send Feedback
---

The RibbonItemEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Application | The current UIApplication. |

# See Also

RibbonItemEventArgs Class

Autodesk.Revit.UI.Events Namespace